# Query's

 
## Tabel abibliotheken

De [query voor abibliotheken](https://github.com/nl-digigo/NLCS/blob/main/code/Query%20abibliotheken.rq) resulteert in een tabel zoals deze:

|  abibliotheek  |
|  ------------  |
|  ACO  |
|  AGR  |
|  AGW  |
|  AIE  |
|  AKG  |
|  AMO  |
|  AMW  |
|  AOG  |
|  AVH  |


De query ziet er als volgt uit: 

<pre data-codelanguage="sparql">
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX owl: <http://www.w3.org/2002/07/owl#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
PREFIX dcterms: <http://purl.org/dc/terms/>
PREFIX sh: <http://www.w3.org/ns/shacl#>

# Retrieves all abibliotheek info and stores it in the familiar Excel/CSV format

SELECT distinct ?bibliotheek

WHERE {
  ?NLCSObjectTopConcept a owl:Class .
  ?NLCSObjectTopConcept skos:prefLabel "Arcering" .
  ?Abib rdfs:subClassOf ?NLCSObjectTopConcept.
  ?Abib skos:prefLabel ?bibliotheek .
}
orderby ?bibliotheek
</pre>

<div class="issue" data-number="270"></div>


## Tabel arceringen

De [query voor arceringen](https://github.com/nl-digigo/NLCS/blob/main/code/Query%20arceringen.rq) resulteert in een tabel zoals deze, gespiegeld voor betere leesbaarheid:

|          |      |      |      |
|----------|------|------|------|
| FASE     |    B   |      |      |
| BIB      |  AVH  | AVH  | AVH  |
| ARCERING |   B-AVH-ASFALT-SOD   |  AVH-GLAS-SO  |  AVH-GEOTEXTIEL-SO  |
| opt      | SOD   | SO   | SO   |
| ID       | 3962 | 151 / 396  | 150  |
| VRKL_KORT| asfaltbestaand | glas | geotextiel |
| VRKL_LANG|      |      |      |
| STATUS   | *    | *    | *    |


Waarbij VRKL_LANG is leeggelaten, daar staat een getallenreeks met soms komma's erin die niet lekker download naar een CSV


De query ziet er als volgt uit: 

<pre data-codelanguage="sparql">
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX owl: <http://www.w3.org/2002/07/owl#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
PREFIX dcterms: <http://purl.org/dc/terms/>
PREFIX sh: <http://www.w3.org/ns/shacl#>

# Retrieves all Arcering information and stores it in the familiar Excel/CSV format

SELECT DISTINCT ?FASE ?BIB ?ARCERING ?opt ?ID ?VRKL_KORT ?VRKL_LANG ?STATUS
WHERE {
  ?ArceringTopConcept a owl:Class .
  ?ArceringTopConcept skos:prefLabel "Arcering" .
  ?Abib rdfs:subClassOf ?ArceringTopConcept .
  ?Abib skos:prefLabel ?BIB .
  ?Arcering rdfs:subClassOf+ ?Abib .
  ?Arcering skos:prefLabel ?ARCERING .
optional {
  ?Arcering rdfs:subClassOf ?bnodeStatus .
  ?bnodeStatus owl:onProperty ?StatusProperty .
  ?StatusProperty skos:prefLabel "Status" .
  OPTIONAL {    ?StatusProperty owl:hasValue/skos:prefLabel ?StatusValue .  }
    }
  BIND( COALESCE(?StatusValue, "*") AS ?STATUS) .
  FILTER (CONTAINS(STR(?ARCERING), STR(CONCAT(STR(?BIB), "-")))) 
  OPTIONAL {
    BIND (STRBEFORE(STR(?ARCERING), STR(CONCAT(CONCAT("-", STR(?BIB)), "-" ))) AS ?FASE) .
	optional {    bind ( strafter(substr(?ARCERING,5),"-") as ?opt) }
  } OPTIONAL {
    ?Arcering ?IDProperty ?ID .
    ?IDProperty skos:prefLabel "ID" .
  } OPTIONAL {
    ?Arcering ?VRKL_KORTProperty ?VRKL_KORT .
    ?VRKL_KORTProperty skos:prefLabel "VRKL_KORT" .
  } OPTIONAL {
    ?Arcering ?VRKL_LANGProperty ?VRKL_LANG .
    ?VRKL_LANGProperty skos:prefLabel "VRKL_LANG" .
  } 
} 
</pre>

<div class="issue" data-number="280"></div>

<div class="issue" data-number="261"></div>


<div class="issue" data-number="279"></div>


## Tabel disciplines
De [query voor disciplines](https://github.com/nl-digigo/NLCS/blob/main/code/Query%20disciplines.rq) resulteert in een tabel zoals deze:

| Code | Verklaring                                                                                                                                                                                                                                                        |
| ---- | ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |
| CO   | Vorm- en wapeningstekeningen van civieltechnische constructies, zoals: brug, tunnel, onderdoorgang, viaduct, sluizencomplex, spoortunnel, faunapassage.                                                                                                            |
| GV   | Vormgeving van landschappelijke en stedelijk groene inrichting van de omgeving ten behoeve van beplantingsplannen, groenbeheerplannen, groenstructuurplannen en dergelijke. Situatie-, dwars- en lengteprofielen en detailtekeningen.                             |
| ME   | Landmeetkundige tekeningen Bijvoorbeeld: het genereren van een GIS-model op basis van het IMgeo protocol vanuit een NLCS model.                                                                                                                                |
| MI   | Vormgeving van (water)bodemsaneringen, inclusief situatie-, dwars- en lengteprofielen en detailtekeningen.                                                                                                                                                      |
| OI   | Vormgeving van de ondergrondse infrastructuur (kabels en leidingen). Bestaande situatie inclusief te verwijderen en toekomstige situatie. Situatie-, dwars- en lengteprofielen en detailtekeningen.                                                               |
| PV   | Vormgeving van stedenbouwkundige ontwerpen: verkavelingsplannen, inrichtingsplannen, matenplannen en exploitatieplannen.                                                                                                                                           |
| SB   | Vormgeving van spoorwegen en kunstwerken, bestaande situatie inclusief te verwijderen en toekomstige situatie. Inclusief breedspoor, smalspoor, tram, metro en lightrail. Situatie-, dwars- en lengteprofielen en detailtekeningen.                                    |
| WA   | Vormgeving van waterwegen zoals: rivieren, kanalen, uiterwaarden, oeverbescherming en zeeweringen, inclusief kunstwerken, bestaande situatie inclusief te verwijderen en toekomstige situatie. Situatie-, dwars- en lengteprofielen en detailtekeningen.               |
| WE   | Vormgeving van wegen en kunstwerken, bestaande situatie inclusief te verwijderen en toekomstige situatie met daarin opgenomen wegmeubilair, markering en geleideconstructies. Situatie-, dwars- en lengteprofielen en detailtekeningen.                              |
| XX   | Onafhankelijk van discipline                                                                                                                                                                                                                                     |


De query ziet er als volgt uit: 

<pre data-codelanguage="sparql">
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX owl: <http://www.w3.org/2002/07/owl#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
PREFIX dcterms: <http://purl.org/dc/terms/>
PREFIX sh: <http://www.w3.org/ns/shacl#>

# Retrieves all Discipline information and stores it in the familiar Excel/CSV format

SELECT DISTINCT ?Code ?Verklaring
WHERE {
?DisciplineTopConcept skos:prefLabel "Disciplines" .
    ?DISCIPLINE a ?DisciplineTopConcept ;
                skos:prefLabel ?Code ;
                skos:definition ?Verklaring .
} orderby ?Code
</pre>

<div class="issue" data-number="262"></div>


## Tabellen hoofdgroep
De [query voor de tabellen van de hoofdgroepen](https://github.com/nl-digigo/NLCS/blob/main/code/Query%20hoofdgroepen.rq) resulteert in een tabel zoals deze, de rijen en kolommen zijn omgekeerd ten behoeve van de leesbaarheid in dit document:

| OMSCHRIJVING               | HOUTVORM                             | AANGRENZENDE CONSTRUCTIE             | VERBINDING                           | REPARATIES                            |
| -------------------------- | ------------------------------------- | ------------------------------------- | ------------------------------------ | ------------------------------------- |
| STATUS                    | *                                   | *                                   | *                                  | *                                   |
| DISCIPLINE                | **                                  | **                                  | **                                 | **                                  |
| Hoofdgroep                | HC                                  | HC                                  | HC                                 | HC                                  |
| Object                    | HOUTVORM                            | AANGRENZENDE CONSTRUCTIE             | VERBINDING                          | REPARATIES                           |
| SubObject01               |                                     |                                     |                                    |                                     |
| SubObject02               |                                     |                                     |                                    |                                     |
| SubObject03               |                                     |                                     |                                    |                                     |
| SubObject04               |                                     |                                     |                                    |                                     |
| SubObject05               |                                     |                                     |                                    |                                     |
| Bewerking                 |                                     |                                     |                                    |                                     |
| Element                   | G/A                                 | G                                   | G                                  | G                                   |
| Arcering                  | ACO:ACO-HOUT                        | ACO:ACO-AANGRENZENDE CONSTRUCTIE    | ACO:ACO-VERBINDING                 | ACO:ACO-REPARATIES                  |
| Symbool                   |                                     |                                     |                                    |                                     |
| Laagnaam                  | *-**-HC-HOUTVORM-G/A                 | *-**-HC-AANGRENZENDE CONSTRUCTIE-G  | *-**-HC-VERBINDING-G               | *-**-HC-REPARATIES-G                |
| BLineweight               | 0.18                                | 0.18                                | 0.18                               | 0.18                                |
| BColor                    | 30                                  | 7                                   | 140                                | 170                                 |
| BColorA                   | 252                                 | 253                                 | 252                                | 172                                 |
| BColorGD                  | 40                                  | 7                                   | 130                                | 170                                 |
| BColorGN                  | 10                                  | 20                                  | 10                                 | 170                                 |
| BColorV                   | 253                                 | 253                                 | 253                                | 253                                 |
| B_Linetype                | CONTINUOUS                          | CONTINUOUS                          | CONTINUOUS                         | CONTINUOUS                          |
| NLineweight               | 0.25                                | 0.18                                | 0.18                               | 0.25                                |
| NColor                    | 30                                  | 7                                   | 140                                | 170                                 |
| NColorA                   | 252                                 | 253                                 | 252                                | 172                                 |
| NColorGD                  | 40                                  | 7                                   | 130                                | 170                                 |
| NColorGN                  | 10                                  | 20                                  | 10                                 | 170                                 |
| NColorV                   | 253                                 | 253                                 | 253                                | 253                                 |
| N_Linetype                | CONTINUOUS                          | CONTINUOUS                          | CONTINUOUS                         | CONTINUOUS                          |
| VLineweight               | 0.25                                | 0.18                                | 0.18                               | 0.25                                |
| VColor                    | 30                                  | 7                                   | 140                                | 170                                 |
| VColorA                   | 252                                 | 253                                 | 252                                | 172                                 |
| VColorGD                  | 40                                  | 7                                   | 130                                | 170                                 |
| VColorGN                  | 10                                  | 20                                  | 10                                 | 170                                 |
| VColorV                   | 253                                 | 253                                 | 253                                | 253                                 |
| V_Linetype                | CONTINUOUS                          | CONTINUOUS                          | CONTINUOUS                         | CONTINUOUS                          |
| TLineweight               | 0.25                                | 0.18                                | 0.18                               | 0.25                                |
| TColor                    | 30                                  | 7                                   | 140                                | 170                                 |
| TColorA                   | 252                                 | 253                                 | 252                                | 172                                 |
| TColorGD                  | 40                                  | 7                                   | 130                                | 170                                 |
| TColorGN                  | 10                                  | 20                                  | 10                                 | 170                                 |
| TColorV                   | 253                                 | 253                                 | 253                                | 253                                 |
| T_Linetype                | CONTINUOUS                          | CONTINUOUS                          | CONTINUOUS                         | CONTINUOUS                          |
| VRKL_KORT                 |                                     |                                     |                                    |                                     |
| VRKL_LANG                 |                                     |                                     |                                    |                                     |
| ID                        | 2797                                | 2803                                | 2800                               | 2808                                |
| KIND_VAN                  |                                     |                                     |                                    |                                     |


De query ziet er als volgt uit: 

<pre data-codelanguage="sparql">
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX owl: <http://www.w3.org/2002/07/owl#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
PREFIX dcterms: <http://purl.org/dc/terms/>
PREFIX sh: <http://www.w3.org/ns/shacl#>

# Retrieves all Hoofdgroep information and stores it in the familiar Excel/CSV format

SELECT distinct 
?OMSCHRIJVING ?STATUS ?DISCIPLINE ?Hoofdgroep ?Object ?SubObject01 ?SubObject02 ?SubObject03 ?SubObject04 ?SubObject05 ?Bewerking ?Element ?Arcering ?Symbool ?Laagnaam 
?BLineweight ?BColor ?BColorA ?BColorGD ?BColorGN ?BColorV ?B_Linetype 
?NLineweight ?NColor ?NColorA ?NColorGD ?NColorGN ?NColorV ?N_Linetype 
?VLineweight ?VColor ?VColorA ?VColorGD ?VColorGN ?VColorV ?V_Linetype 
?TLineweight ?TColor ?TColorA ?TColorGD ?TColorGN ?TColorV ?T_Linetype
?VRKL_KORT ?VRKL_LANG ?ID ?KIND_VAN
WHERE {
  ?NLCSObjectTopConcept a owl:Class .
  ?NLCSObjectTopConcept skos:prefLabel "NLCS-object" .
  ?Hoofdgroep2 rdfs:subClassOf ?NLCSObjectTopConcept .
  ?Hoofdgroep2 skos:prefLabel ?HOOFDGROEP .
  ?NLCSObject rdfs:subClassOf+ ?Hoofdgroep2 .
  ?NLCSObject skos:prefLabel ?OMSCHRIJVING .
  
  ?NLCSObject rdfs:subClassOf ?bnodeStatus .
  ?bnodeStatus owl:onProperty ?StatusProperty .
  ?StatusProperty skos:prefLabel "Status" .
  OPTIONAL {
    ?StatusProperty owl:hasValue/skos:prefLabel ?StatusValue .
  }
  BIND( COALESCE(?StatusValue, "*") AS ?STATUS) .
  ?NLCSObject rdfs:subClassOf ?bnodeDiscipline .
  ?bnodeDiscipline owl:onProperty ?DisciplineProperty .
  ?DisciplineProperty skos:prefLabel "Discipline" .
  OPTIONAL {
    ?DisciplineProperty owl:hasValue/skos:prefLabel ?DisciplineValue .
  }
  BIND( COALESCE(?DisciplineValue, "**") AS ?DISCIPLINE) .
  OPTIONAL {
    ?NLCSObject rdfs:subClassOf ?bnodeArcering .
    ?bnodeArcering owl:onProperty <https://w3id.org/nen2660/def#isDescribedBy> .
    ?bnodeArcering owl:onClass ?ARCERING .
    ?ARCERING rdfs:subClassOf* ?ArceringTopConcept .
    ?ArceringTopConcept skos:prefLabel "Arcering" .
    ?ARCERING skos:altLabel ?Arcering .
    FILTER( CONTAINS(STR(?ARCERING), "http://data.digigo.nu/nlcs/def/"))
  } OPTIONAL {
    ?NLCSObject rdfs:subClassOf ?bnodeSymbool .
    ?bnodeSymbool owl:onProperty <https://w3id.org/nen2660/def#isDescribedBy> .
    ?bnodeSymbool owl:onClass ?SYMBOOL .
    ?SYMBOOL rdfs:subClassOf* ?SymboolTopConcept .
    ?SymboolTopConcept skos:prefLabel "Symbool" .
    ?SYMBOOL skos:altLabel ?Symbool .
    FILTER( CONTAINS(STR(?SYMBOOL), "http://data.digigo.nu/nlcs/def/"))
  }
  ?NLCSObject ?LaagnaamProperty ?Laagnaam .
  ?LaagnaamProperty skos:prefLabel "Laagnaam" .
  OPTIONAL {
    ?NLCSObject ?BLineweightProperty ?BLineweight .
    ?BLineweightProperty skos:prefLabel "B lineweight" .
    ?NLCSObject ?BColorProperty ?BColor .
    ?BColorProperty skos:prefLabel "B color" .
    ?NLCSObject ?BColorAProperty ?BColorA .
    ?BColorAProperty skos:prefLabel "B color A" .
    ?NLCSObject ?BColorGDProperty ?BColorGD .
    ?BColorGDProperty skos:prefLabel "B color GD" .
    ?NLCSObject ?BColorGNProperty ?BColorGN .
    ?BColorGNProperty skos:prefLabel "B color GN" .
    ?NLCSObject ?BColorVProperty ?BColorV .
    ?BColorVProperty skos:prefLabel "B color V" .
    ?NLCSObject ?BLinetypeProperty ?BLinetype .
    ?BLinetypeProperty skos:prefLabel "B linetype" .
    ?BLinetype skos:prefLabel ?B_Linetype .
  } OPTIONAL {
    ?NLCSObject ?NLineweightProperty ?NLineweight .
    ?NLineweightProperty skos:prefLabel "N lineweight" .
    ?NLCSObject ?NColorProperty ?NColor .
    ?NColorProperty skos:prefLabel "N color" .
    ?NLCSObject ?NColorAProperty ?NColorA .
    ?NColorAProperty skos:prefLabel "N color A" .
    ?NLCSObject ?NColorGDProperty ?NColorGD .
    ?NColorGDProperty skos:prefLabel "N color GD" .
    ?NLCSObject ?NColorGNProperty ?NColorGN .
    ?NColorGNProperty skos:prefLabel "N color GN" .
    ?NLCSObject ?NColorVProperty ?NColorV .
    ?NColorVProperty skos:prefLabel "N color V" .
    ?NLCSObject ?NLinetypeProperty ?NLinetype .
    ?NLinetypeProperty skos:prefLabel "N linetype" .
    ?NLinetype skos:prefLabel ?N_Linetype .
  } OPTIONAL {
    ?NLCSObject ?TLineweightProperty ?TLineweight .
    ?TLineweightProperty skos:prefLabel "T lineweight" .
    ?NLCSObject ?TColorProperty ?TColor .
    ?TColorProperty skos:prefLabel "T color" .
    ?NLCSObject ?TColorAProperty ?TColorA .
    ?TColorAProperty skos:prefLabel "T color A" .
    ?NLCSObject ?TColorGDProperty ?TColorGD .
    ?TColorGDProperty skos:prefLabel "T color GD" .
    ?NLCSObject ?TColorGNProperty ?TColorGN .
    ?TColorGNProperty skos:prefLabel "T color GN" .
    ?NLCSObject ?TColorVProperty ?TColorV .
    ?TColorVProperty skos:prefLabel "T color V" .
    ?NLCSObject ?TLinetypeProperty ?TLinetype .
    ?TLinetypeProperty skos:prefLabel "T linetype" .
    ?TLinetype skos:prefLabel ?T_Linetype .
  } OPTIONAL {
    ?NLCSObject ?VLineweightProperty ?VLineweight .
    ?VLineweightProperty skos:prefLabel "V lineweight" .
    ?NLCSObject ?VColorProperty ?VColor .
    ?VColorProperty skos:prefLabel "V color" .
    ?NLCSObject ?VColorAProperty ?VColorA .
    ?VColorAProperty skos:prefLabel "V color A" .
    ?NLCSObject ?VColorGDProperty ?VColorGD .
    ?VColorGDProperty skos:prefLabel "V color GD" .
    ?NLCSObject ?VColorGNProperty ?VColorGN .
    ?VColorGNProperty skos:prefLabel "V color GN" .
    ?NLCSObject ?VColorVProperty ?VColorV .
    ?VColorVProperty skos:prefLabel "V color V" .
    ?NLCSObject ?VLinetypeProperty ?VLinetype .
    ?VLinetypeProperty skos:prefLabel "V linetype" .
    ?VLinetype skos:prefLabel ?V_Linetype .
  }
  OPTIONAL {
    ?NLCSObject ?VRKLProperty ?VRKL_KORT .
    ?VRKLProperty skos:prefLabel "VRKL_KORT" .
  } OPTIONAL {
    ?NLCSObject ?IDProperty ?ID .
    ?IDProperty skos:prefLabel "ID" .
  } OPTIONAL {
    ?NLCSObject rdfs:subClassOf ?NLCSParentObject .
    ?NLCSParentObject ?IDPropertyParent ?KIND_VAN .
    ?IDPropertyParent skos:prefLabel "ID" .
  } 
    OPTIONAL {
    ?NLCSObject ?VRKL_LANGProperty ?VRKL_LANG .
    ?VRKL_LANGProperty skos:prefLabel "VRKL_LANG" .
  } 
    bind (strbefore (?Laagnaam,"-") as ?Status)
    bind (strbefore (strafter (?Laagnaam,"-"),"-") as ?Discipline)
	  bind (strbefore (strafter (strafter (?Laagnaam,"-"),"-"),"-") as ?Hoofdgroep)
    bind (strafter(strafter (strafter (?Laagnaam,"-"),"-"),"-") as ?ObjectTotal )
    bind (strafter (strafter (strafter (?Laagnaam,"-"),"-"),"-") as ?ElementPrePre )
    bind ( if ( contains(?ElementPrePre, "-"), strafter(?ElementPrePre, "-"),?ElementPrePre) as ?ElementPre )
    bind ( if ( contains(?ElementPre, "-"), strafter(?ElementPre, "-"),?ElementPre) as ?Element )
    bind ( if ( contains(?ObjectTotal, "_"), strbefore(?ObjectTotal, "_"),strbefore(?ObjectTotal, "-")) as ?Object )
    bind ( if ( contains(?ObjectTotal, "_"), strafter(?ObjectTotal, "_"),strafter(?ObjectTotal, "-")) as ?SubObject01Total )
    bind ( if ( contains(?SubObject01Total, "_"), strbefore(?SubObject01Total, "_"),strbefore(?SubObject01Total, "-")) as ?SubObject01 )
    bind ( if ( contains(?SubObject01Total, "_"), strafter(?SubObject01Total, "_"),strafter(?SubObject01Total, "-")) as ?SubObject02Total )
    bind ( if ( contains(?SubObject02Total, "_"), strbefore(?SubObject02Total, "_"),strbefore(?SubObject02Total, "-")) as ?SubObject02 )
    bind ( if ( contains(?SubObject02Total, "_"), strafter(?SubObject02Total, "_"),strafter(?SubObject02Total, "-")) as ?SubObject03Total )
    bind ( if ( contains(?SubObject03Total, "_"), strbefore(?SubObject03Total, "_"),strbefore(?SubObject03Total, "-")) as ?SubObject03 )
    bind ( if ( contains(?SubObject03Total, "_"), strafter(?SubObject03Total, "_"),strafter(?SubObject03Total, "-")) as ?SubObject04Total )
    bind ( if ( contains(?SubObject04Total, "_"), strbefore(?SubObject04Total, "_"),strbefore(?SubObject04Total, "-")) as ?SubObject04 )
    bind ( if ( contains(?SubObject04Total, "_"), strafter(?SubObject04Total, "_"),strafter(?SubObject04Total, "-")) as ?SubObject05Total )
    bind ( if ( contains(?SubObject05Total, "_"), strbefore(?SubObject05Total, "_"),strbefore(?SubObject05Total, "-")) as ?SubObject05 )
    bind ( if ( contains(?SubObject05Total, "_"), strafter(?SubObject05Total, "_"),strafter(?SubObject05Total, "-")) as ?BewerkingTotal )
    bind ( if ( contains(?BewerkingTotal, "_"), strbefore(?BewerkingTotal, "_"),strbefore(?BewerkingTotal, "-")) as ?Bewerking )
}
</pre>

<div class="issue" data-number="263"></div>





## Hoofdgroep afkortingen
De [query voor afkortingen van hoofdgroepen](https://github.com/nl-digigo/NLCS/blob/main/code/Query%20hoofdgroepen%20afkortingen.rq) resulteert in een tabel zoals deze:



De query ziet er als volgt uit: 

<pre data-codelanguage="sparql">
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX owl: <http://www.w3.org/2002/07/owl#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
PREFIX dcterms: <http://purl.org/dc/terms/>
PREFIX sh: <http://www.w3.org/ns/shacl#>

# Retrieves all general Hoofdgroep information and stores it in the familiar Excel/CSV format

SELECT distinct ?Afkorting ?Hoofdgroep ?ID

WHERE {
  ?NLCSObjectTopConcept a owl:Class .
  ?NLCSObjectTopConcept skos:prefLabel "NLCS-object" .
  ?HOOFDGROEP rdfs:subClassOf ?NLCSObjectTopConcept .
  ?HOOFDGROEP skos:prefLabel ?Afkorting ;
               skos:altLabel ?Hoofdgroep .
               OPTIONAL {
    ?HOOFDGROEP ?IDProperty ?ID .
    ?IDProperty skos:prefLabel "ID" .
  }
} orderby ?Afkorting
</pre>

<div class="issue" data-number="266"></div>

<div class="issue" data-number="267"></div>


## Tabel lijnkleuren
De [query voor lijnkleuren]() resulteert in een tabel zoals deze:

De query ziet er als volgt uit: 

<pre data-codelanguage="sparql">
</pre>

<div class="issue" data-number="269"></div>


## Tabel lijntypes
De [query voor lijntypes](https://github.com/nl-digigo/NLCS/blob/main/code/Query%20lijntypes.rq) resulteert in een tabel zoals deze:

| ID  | HOOFDGROEP | LIJNTYPE          | DEFINITIE                                            | opt | FASE | STATUS |
| --- | ---------- | ----------------- | ---------------------------------------------------- | --- | ---- | ------ |
| 10  | AM         | AM-AS-SO          | A,10,-2,2,-2, SO                                     |     |      | *      |
| 106 | KG         | KG-LAND-SO         | A,0,[KRUISJE,NLCS.SHX,s=1],-3.5, SO                  |     |      | *      |
| 107 | KG         | KG-PROVINCIE-SO    | A,2.5,-2.75,[KRUISJE,NLCS.SHX,s=1],-2.75, SO        |     |      | *      |
| 108 | KG         | KG-GEMEENTE-SO     | A,1,-2.25,[KRUISJE,NLCS.SHX,s=1],-2.25, SO          |     |      | *      |
| 109 | KG         | KG-WATERSCHAP-SO   | A,5.5,-2,[KRUISJE,NLCS.SHX,s=0.75],-3,[KRUISJE,NLCS.SHX,s=0.75],-2, SO |     |      | *      |
| 11  | AM         | V-AM-AS-SO         | A,10,[VERWIJDEREN2,NLCS.SHX,x=-5,s=1],-2,2,-2, SO | V   |      | *      |


De query ziet er als volgt uit: 

<pre data-codelanguage="sparql">
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX owl: <http://www.w3.org/2002/07/owl#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
PREFIX dcterms: <http://purl.org/dc/terms/>
PREFIX sh: <http://www.w3.org/ns/shacl#>

# Retrieves all Lijntype information and stores it in the familiar Excel/CSV format

SELECT DISTINCT ?ID ?HOOFDGROEP ?LIJNTYPE ?DEFINITIE ?opt ?FASE ?STATUS
WHERE {
  ?LijntypeTopConcept a owl:Class .
  ?LijntypeTopConcept skos:prefLabel "Lijntype" .
  ?Hoofdgroep rdfs:subClassOf ?LijntypeTopConcept .
  ?Hoofdgroep skos:prefLabel ?HOOFDGROEP .
  ?Lijntype rdfs:subClassOf+ ?Hoofdgroep .
  ?Lijntype skos:prefLabel ?LIJNTYPE .
  BIND ( IF(?Lijntype = ?Hoofdgroep, IF(?LijntypeName IN ("V-CONTINUOUS-SO", "CONTINUOUS"), ?Lijntype, ?undefined), ?Lijntype) AS ?NotHoofdgroep) .
  FILTER (?Lijntype = ?NotHoofdgroep) .
    optional { bind ( strafter(?LIJNTYPE,"-") as ?opt2)
  bind ( if ( contains(?opt2,"-"),strafter(?opt2,"-"),?opt2) as ?opt3 )
  bind ( if ( contains(?opt3,"-"),strafter(?opt3,"-"),?opt3) as ?opt4 )
        bind ( if (strlen(?opt4)>4,"",?opt4) as ?opt ) }
  OPTIONAL {
    ?Lijntype ?IDProperty ?ID .
    ?IDProperty skos:prefLabel "ID" .
  } OPTIONAL {
    ?Lijntype skos:definition ?DEFINITIE .
  } 
      OPTIONAL {
    BIND (STRBEFORE(STR(?LIJNTYPE), STR(CONCAT(CONCAT("-", STR(?HOOFDGROEP)), "-" ))) AS ?FASE) . }
    OPTIONAL {
    ?Lijntype rdfs:subClassOf ?bnodeStatus .
  ?bnodeStatus owl:onProperty ?StatusProperty .
  ?StatusProperty skos:prefLabel "Status" .
        optional {
    ?StatusProperty owl:hasValue/skos:prefLabel ?StatusValue .
    }
  }
  BIND( COALESCE(?StatusValue, "*") AS ?STATUS) .
}
orderby ?ID
</pre>

<div class="issue" data-number="271"></div>

<div class="issue" data-number="272"></div>

## Tabel lijnweights
De [query voor lijndiktes](https://github.com/nl-digigo/NLCS/blob/main/code/Query%20lineweights.rq) resulteert in een tabel zoals deze:

De query ziet er als volgt uit: 

<pre data-codelanguage="sparql">
PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
select distinct ?Lineweight
where { 
	   {
    ?NLCSObject ?BLineweightProperty ?Lineweight .
    ?BLineweightProperty skos:prefLabel "B lineweight" .
  } 
    union {
    ?NLCSObject ?NLineweightProperty ?Lineweight .
    ?NLineweightProperty skos:prefLabel "N lineweight" .
  } 
    union {
    ?NLCSObject ?TLineweightProperty ?Lineweight .
    ?TLineweightProperty skos:prefLabel "T lineweight" .
  } 
    union {
    ?NLCSObject ?VLineweightProperty ?Lineweight .
    ?VLineweightProperty skos:prefLabel "V lineweight" .
  }
} 
orderby ?Lineweight
</pre>

<div class="issue" data-number="273"></div>

## Tabel object
De [query voor een object](https://github.com/nl-digigo/NLCS/blob/main/code/Query%20NLCS-objects.rq) resulteert in een tabel zoals deze, gespiegeld voor leesbaarheid:

De toelichting op de onderdelen van deze tabel staan in de [Code-documentatie](https://nl-digigo.github.io/NLCS/code_documentation/#objecten)

| NLCSObject                                      | http://data.digigo.nu/nlcs/def/c132cd12-d85e-46d8-b862-27c6d713a883 | http://data.digigo.nu/nlcs/def/e1303c6d-5701-4ffb-a68f-1f9b42aa049c | http://data.digigo.nu/nlcs/def/1e16b5eb-015c-4c1f-9d10-6ba71dfa167b |
| ------------------------------------------------ | -------------------------------------------------------------------- | -------------------------------------------------------------------- | -------------------------------------------------------------------- |
| OMSCHRIJVING                   | HOUTVORM                      | AANGRENZENDE CONSTRUCTIE       | VERBINDING                    |
| STATUS | *      | *      | *      |
| DISCIPLINE | **         | **         | **         |
| HOOFDGROEP | HC         | HC         | HC         |
| ARCERING |          |          |          |
| ARCERINGName | *-**-HC-HOUTVORM-G/A | *-**-HC-AANGRENZENDE CONSTRUCTIE-G | *-**-HC-VERBINDING-G |
| SYMBOOL | 0.18    | 0.18    | 0.18    |
| SYMBOOLName | 30           | 7            | 140          |
| LAAGNAAM | 252      | 253      | 252      |
| BLineweight | 40           | 7            | 130          |
| BColor | 10     | 20     | 10     |
| BColorA | 253     | 253     | 253     |
| BColorGD | 40       | 7        | 130      |
| BColorGN | 10      | 20      | 10      |
| BColorV | 253     | 253     | 253     |
| BLinetype | CONTINUOUS | CONTINUOUS | CONTINUOUS |
| BLinetypeName | 0.25         | 0.18         | 0.18         |
| NLineweight | 30     | 7      | 140    |
| NColor | 252     | 253    | 252    |
| NColorA | 40       | 7        | 130      |
| NColorGD | 10      | 20      | 10      |
| NColorGN | 253     | 253     | 253     |
| NColorV | CONTINUOUS | CONTINUOUS | CONTINUOUS |
| NLinetype | 0.25         | 0.18         | 0.18         |
| NLinetypeName | 30     | 7      | 140    |
| TLineweight | 252     | 253    | 252    |
| TColor | 40       | 10      | 130      |
| TColorA | 10      | 20      | 10      |
| TColorGD | 253     | 253     | 253     |
| TColorGN | CONTINUOUS | CONTINUOUS | CONTINUOUS |
| TColorV | 0.25         | 0.18         | 0.18         |
| TLinetype | 30     | 7      | 140    |
| TLinetypeName | CONTINUOUS | CONTINUOUS | CONTINUOUS |
| VLineweight | 0.25         | 0.18         | 0.18         |
| VColor | 30     | 7      | 140    |
| VColorA | 252     | 253    | 252    |
| VColorGD | 40       | 7        | 130      |
| VColorGN | 10      | 20      | 10      |
| VColorV | 253     | 253     | 253     |
| VLinetype | CONTINUOUS | CONTINUOUS | CONTINUOUS |
| VLinetypeName | 0.25         | 0.18         | 0.18         |
| VRKL_KORT | G/A | G | G |
| VRKL_LANG | HOUT | AANGRENZENDE CONSTRUCTIE | VERBINDING |
| ID | 2797      | 2803      | 2800      |
| KIND_VAN |           |           |           |
| FASE |           |           |           |
| Bewerking |           |           |           |
| Element |           |           |           |



De query ziet er als volgt uit: 

<pre data-codelanguage="sparql">
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX owl: <http://www.w3.org/2002/07/owl#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
PREFIX dcterms: <http://purl.org/dc/terms/>
PREFIX sh: <http://www.w3.org/ns/shacl#>

# Retrieves all NLCS-Object information and stores it in the familiar Excel/CSV format

SELECT ?NLCSObject ?OMSCHRIJVING ?STATUS ?DISCIPLINE ?HOOFDGROEP ?ARCERING ?ARCERINGName ?SYMBOOL ?SYMBOOLName ?LAAGNAAM 
?BLineweight ?BColor ?BColorA ?BColorGD ?BColorGN ?BColorV ?BLinetype ?BLinetypeName
?NLineweight ?NColor ?NColorA ?NColorGD ?NColorGN ?NColorV ?NLinetype ?NLinetypeName
?TLineweight ?TColor ?TColorA ?TColorGD ?TColorGN ?TColorV ?TLinetype ?TLinetypeName
?VLineweight ?VColor ?VColorA ?VColorGD ?VColorGN ?VColorV ?VLinetype ?VLinetypeName
?VRKL_KORT ?VRKL_LANG ?ID ?KIND_VAN ?FASE ?Bewerking ?Element
WHERE {
  ?NLCSObjectTopConcept a owl:Class .
  ?NLCSObjectTopConcept skos:prefLabel "NLCS-object" .
  ?Hoofdgroep rdfs:subClassOf ?NLCSObjectTopConcept .
  ?Hoofdgroep skos:prefLabel ?HOOFDGROEP .
  ?NLCSObject rdfs:subClassOf+ ?Hoofdgroep .
  ?NLCSObject skos:prefLabel ?OMSCHRIJVING .
  
  ?NLCSObject rdfs:subClassOf ?bnodeStatus .
  ?bnodeStatus owl:onProperty ?StatusProperty .
  ?StatusProperty skos:prefLabel "Status" .
  OPTIONAL {
    ?StatusProperty owl:hasValue/skos:prefLabel ?StatusValue .
  }
  BIND( COALESCE(?StatusValue, "*") AS ?STATUS) .
  ?NLCSObject rdfs:subClassOf ?bnodeDiscipline .
  ?bnodeDiscipline owl:onProperty ?DisciplineProperty .
  ?DisciplineProperty skos:prefLabel "Discipline" .
  OPTIONAL {
    ?DisciplineProperty owl:hasValue/skos:prefLabel ?DisciplineValue .
  }
  BIND( COALESCE(?DisciplineValue, "**") AS ?DISCIPLINE) .
  OPTIONAL {
    ?NLCSObject rdfs:subClassOf ?bnodeArcering .
    ?bnodeArcering owl:onProperty <https://w3id.org/nen2660/def#isDescribedBy> .
    ?bnodeArcering owl:onClass ?ARCERING .
    ?ARCERING rdfs:subClassOf* ?ArceringTopConcept .
    ?ArceringTopConcept skos:prefLabel "Arcering" .
    ?ARCERING skos:prefLabel ?ARCERINGName .
    FILTER( CONTAINS(STR(?ARCERING), "http://data.digigo.nu/nlcs/def/"))
  } OPTIONAL {
    ?NLCSObject rdfs:subClassOf ?bnodeSymbool .
    ?bnodeSymbool owl:onProperty <https://w3id.org/nen2660/def#isDescribedBy> .
    ?bnodeSymbool owl:onClass ?SYMBOOL .
    ?SYMBOOL rdfs:subClassOf* ?SymboolTopConcept .
    ?SymboolTopConcept skos:prefLabel "Symbool" .
    ?SYMBOOL skos:prefLabel ?SYMBOOLName .
    FILTER( CONTAINS(STR(?SYMBOOL), "http://data.digigo.nu/nlcs/def/"))
  }
    OPTIONAL {    BIND (STRBEFORE(STR(?SYMBOOL), "-") AS ?FASE ) . }
    ?NLCSObject ?LaagnaamProperty ?LAAGNAAM .
    ?LaagnaamProperty skos:prefLabel "Laagnaam" .
  OPTIONAL {
    ?NLCSObject ?BLineweightProperty ?BLineweight .
    ?BLineweightProperty skos:prefLabel "B lineweight" .
    ?NLCSObject ?BColorProperty ?BColor .
    ?BColorProperty skos:prefLabel "B color" .
    ?NLCSObject ?BColorAProperty ?BColorA .
    ?BColorAProperty skos:prefLabel "B color A" .
    ?NLCSObject ?BColorGDProperty ?BColorGD .
    ?BColorGDProperty skos:prefLabel "B color GD" .
    ?NLCSObject ?BColorGNProperty ?BColorGN .
    ?BColorGNProperty skos:prefLabel "B color GN" .
    ?NLCSObject ?BColorVProperty ?BColorV .
    ?BColorVProperty skos:prefLabel "B color V" .
    ?NLCSObject ?BLinetypeProperty ?BLinetype .
    ?BLinetypeProperty skos:prefLabel "B linetype" .
    ?BLinetype skos:prefLabel ?BLinetypeName .
  } OPTIONAL {
    ?NLCSObject ?NLineweightProperty ?NLineweight .
    ?NLineweightProperty skos:prefLabel "N lineweight" .
    ?NLCSObject ?NColorProperty ?NColor .
    ?NColorProperty skos:prefLabel "N color" .
    ?NLCSObject ?NColorAProperty ?NColorA .
    ?NColorAProperty skos:prefLabel "N color A" .
    ?NLCSObject ?NColorGDProperty ?NColorGD .
    ?NColorGDProperty skos:prefLabel "N color GD" .
    ?NLCSObject ?NColorGNProperty ?NColorGN .
    ?NColorGNProperty skos:prefLabel "N color GN" .
    ?NLCSObject ?NColorVProperty ?NColorV .
    ?NColorVProperty skos:prefLabel "N color V" .
    ?NLCSObject ?NLinetypeProperty ?NLinetype .
    ?NLinetypeProperty skos:prefLabel "N linetype" .
    ?NLinetype skos:prefLabel ?NLinetypeName .
  } OPTIONAL {
    ?NLCSObject ?TLineweightProperty ?TLineweight .
    ?TLineweightProperty skos:prefLabel "T lineweight" .
    ?NLCSObject ?TColorProperty ?TColor .
    ?TColorProperty skos:prefLabel "T color" .
    ?NLCSObject ?TColorAProperty ?TColorA .
    ?TColorAProperty skos:prefLabel "T color A" .
    ?NLCSObject ?TColorGDProperty ?TColorGD .
    ?TColorGDProperty skos:prefLabel "T color GD" .
    ?NLCSObject ?TColorGNProperty ?TColorGN .
    ?TColorGNProperty skos:prefLabel "T color GN" .
    ?NLCSObject ?TColorVProperty ?TColorV .
    ?TColorVProperty skos:prefLabel "T color V" .
    ?NLCSObject ?TLinetypeProperty ?TLinetype .
    ?TLinetypeProperty skos:prefLabel "T linetype" .
    ?TLinetype skos:prefLabel ?TLinetypeName .
  } OPTIONAL {
    ?NLCSObject ?VLineweightProperty ?VLineweight .
    ?VLineweightProperty skos:prefLabel "V lineweight" .
    ?NLCSObject ?VColorProperty ?VColor .
    ?VColorProperty skos:prefLabel "V color" .
    ?NLCSObject ?VColorAProperty ?VColorA .
    ?VColorAProperty skos:prefLabel "V color A" .
    ?NLCSObject ?VColorGDProperty ?VColorGD .
    ?VColorGDProperty skos:prefLabel "V color GD" .
    ?NLCSObject ?VColorGNProperty ?VColorGN .
    ?VColorGNProperty skos:prefLabel "V color GN" .
    ?NLCSObject ?VColorVProperty ?VColorV .
    ?VColorVProperty skos:prefLabel "V color V" .
    ?NLCSObject ?VLinetypeProperty ?VLinetype .
    ?VLinetypeProperty skos:prefLabel "V linetype" .
    ?VLinetype skos:prefLabel ?VLinetypeName .
  }
  OPTIONAL {
    ?NLCSObject ?VRKLProperty ?VRKL_KORT .
    ?VRKLProperty skos:prefLabel "VRKL_KORT" .
  } OPTIONAL {
    ?NLCSObject ?IDProperty ?ID .
    ?IDProperty skos:prefLabel "ID" .
  } OPTIONAL {
    ?NLCSObject rdfs:subClassOf ?NLCSParentObject .
    ?NLCSParentObject ?IDPropertyParent ?KIND_VAN .
    ?IDPropertyParent skos:prefLabel "ID" .
  } 
    OPTIONAL {
    ?NLCSObject ?VRKL_LANGProperty ?VRKL_LANG .
    ?VRKL_LANGProperty skos:prefLabel "VRKL_LANG" .
  } 
    bind (strafter(strafter (strafter (?Laagnaam,"-"),"-"),"-") as ?ObjectTotal )
    bind (strafter (strafter (strafter (?Laagnaam,"-"),"-"),"-") as ?ElementPrePre )
    bind ( if ( contains(?ElementPrePre, "-"), strafter(?ElementPrePre, "-"),?ElementPrePre) as ?ElementPre )
    bind ( if ( contains(?ElementPre, "-"), strafter(?ElementPre, "-"),?ElementPre) as ?Element )
    bind ( if ( contains(?ObjectTotal, "_"), strbefore(?ObjectTotal, "_"),strbefore(?ObjectTotal, "-")) as ?Object )
    bind ( if ( contains(?ObjectTotal, "_"), strafter(?ObjectTotal, "_"),strafter(?ObjectTotal, "-")) as ?SubObject01Total )
    bind ( if ( contains(?SubObject01Total, "_"), strbefore(?SubObject01Total, "_"),strbefore(?SubObject01Total, "-")) as ?SubObject01 )
    bind ( if ( contains(?SubObject01Total, "_"), strafter(?SubObject01Total, "_"),strafter(?SubObject01Total, "-")) as ?SubObject02Total )
    bind ( if ( contains(?SubObject02Total, "_"), strbefore(?SubObject02Total, "_"),strbefore(?SubObject02Total, "-")) as ?SubObject02 )
    bind ( if ( contains(?SubObject02Total, "_"), strafter(?SubObject02Total, "_"),strafter(?SubObject02Total, "-")) as ?SubObject03Total )
    bind ( if ( contains(?SubObject03Total, "_"), strbefore(?SubObject03Total, "_"),strbefore(?SubObject03Total, "-")) as ?SubObject03 )
    bind ( if ( contains(?SubObject03Total, "_"), strafter(?SubObject03Total, "_"),strafter(?SubObject03Total, "-")) as ?SubObject04Total )
    bind ( if ( contains(?SubObject04Total, "_"), strbefore(?SubObject04Total, "_"),strbefore(?SubObject04Total, "-")) as ?SubObject04 )
    bind ( if ( contains(?SubObject04Total, "_"), strafter(?SubObject04Total, "_"),strafter(?SubObject04Total, "-")) as ?SubObject05Total )
    bind ( if ( contains(?SubObject05Total, "_"), strbefore(?SubObject05Total, "_"),strbefore(?SubObject05Total, "-")) as ?SubObject05 )
    bind ( if ( contains(?SubObject05Total, "_"), strafter(?SubObject05Total, "_"),strafter(?SubObject05Total, "-")) as ?BewerkingTotal )
    bind ( if ( contains(?BewerkingTotal, "_"), strbefore(?BewerkingTotal, "_"),strbefore(?BewerkingTotal, "-")) as ?Bewerking )
}
</pre>


## Tabel sbibliotheken 
De [query voor sbibliotheken](https://github.com/nl-digigo/NLCS/blob/main/code/Query%20sbibliotheken.rq) resulteert in een tabel zoals deze, rijen en kolommen omgekeerd voor betere weergave in dit document: 


|  bibliotheek   | 
|---------|
SAL
SAM
SBC
SBV
SFC
....


De query ziet er als volgt uit: 

<pre data-codelanguage="sparql">
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX owl: <http://www.w3.org/2002/07/owl#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
PREFIX dcterms: <http://purl.org/dc/terms/>
PREFIX sh: <http://www.w3.org/ns/shacl#>

# Retrieves all abibliotheek info and stores it in the familiar Excel/CSV format

SELECT distinct ?bibliotheek

WHERE {
  ?NLCSObjectTopConcept a owl:Class .
  ?NLCSObjectTopConcept skos:prefLabel "Symbool" .
  ?Abib rdfs:subClassOf ?NLCSObjectTopConcept.
  ?Abib skos:prefLabel ?bibliotheek .
}
orderby ?bibliotheek
</pre>

<div class="issue" data-number="287"></div>


## Tabel status 
De [query voor status](https://github.com/nl-digigo/NLCS/blob/main/code/Query%20status.rq) resulteert in een tabel zoals deze:

| Status | Omschrijving               |
|--------|---------------------------|
| B      | bestaand werk              |
| N      | nieuw werk                 |
| R      | revisie                    |
| T      | tijdelijk werk              |
| V      | verwijderd/vervallen werk  |
| X      | onafhankelijk van status/fase |


De query ziet er als volgt uit: 

<pre data-codelanguage="sparql">
PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
select ?Status ?Omschrijving 
where { 
	?statusTopConcept skos:prefLabel "Statussen" .
    ?status a ?statusTopConcept ;
    	skos:prefLabel ?Status ;
        skos:definition ?Omschrijving .
} 
orderby ?Status
</pre>

<div class="issue" data-number="291"></div>



## Tabel symbolen
De [query voor symbolen](https://github.com/nl-digigo/NLCS/blob/main/code/Query%20symbolen.rq) resulteert in een tabel zoals deze:

|  |    |      |     | 
|------|------|------|------|
| FASE | V    |      | V    | 
| sBIB | SVH  | SVH  | SVH  | 
| SYMBOOL | V-SVH-GEOTEXTIEL_KL-SO | SVH-GEOTEXTIEL_KL-SO | V-SVH-GEOTEXTIEL-SO | 
| SYMBOOL_alt | SVH:V-SVH-GEOTEXTIEL_KL | SVH:SVH-GEOTEXTIEL_KL | SVH:V-SVH-GEOTEXTIEL | 
| opt  | SO   | SO   | SO   | 
| STATUS | *    | *    | *    | 
| VRKL_KORT |      |      |      |  
| VRKL_LANG |      |      |      | 



De query ziet er als volgt uit: 

<pre data-codelanguage="sparql">
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX owl: <http://www.w3.org/2002/07/owl#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
PREFIX dcterms: <http://purl.org/dc/terms/>
PREFIX sh: <http://www.w3.org/ns/shacl#>

# Retrieves all Symbool information and stores it in the familiar Excel/CSV format

SELECT DISTINCT ?FASE ?sBIB ?SYMBOOL ?SYMBOOL_alt ?ID ?opt ?STATUS ?VRKL_KORT ?VRKL_LANG
WHERE {
  ?SymboolTopConcept a owl:Class .
  ?SymboolTopConcept skos:prefLabel "Symbool" .
  ?Sbib rdfs:subClassOf ?SymboolTopConcept .
  ?Sbib skos:prefLabel ?sBIB .
  ?Symbool rdfs:subClassOf+ ?Sbib .
  ?Symbool skos:prefLabel ?SYMBOOL .
  optional { ?Symbool skos:altLabel ?SYMBOOL_alt . }
  optional {
  ?Symbool rdfs:subClassOf ?bnodeStatus .
  ?bnodeStatus owl:onProperty ?StatusProperty .
  ?StatusProperty skos:prefLabel "Status" .
  OPTIONAL {    ?StatusProperty owl:hasValue/skos:prefLabel ?StatusValue .  }
    }
  BIND( COALESCE(?StatusValue, "*") AS ?STATUS) .  
  FILTER (CONTAINS(STR(?SYMBOOL), STR(CONCAT(STR(?sBIB), "-")))) 
  OPTIONAL {
    BIND (STRBEFORE(STR(?SYMBOOL), STR(CONCAT(CONCAT("-", STR(?sBIB)), "-" ))) AS ?FASE2) . 
        bind (if(contains(?FASE2,"-"),strbefore(?FASE2,"-"),?FASE2) as ?FASE) }
    optional {
  bind ( strafter(?SYMBOOL,CONCAT(STR(?sBIB),"-")) as ?opt2) 
  bind ( if ( contains(?opt2,"-"),strafter(?opt2,"-"),?opt2) as ?opt3 )
  bind ( if ( contains(?opt3,"-"),strafter(?opt3,"-"),?opt3) as ?opt4 )
  bind ( if (strlen(?opt4)>4,"",?opt4) as ?opt )
  } 
        OPTIONAL {
    ?Symbool ?IDProperty ?ID .
    ?IDProperty skos:prefLabel "ID" .
  }
    OPTIONAL {
    ?Symbool ?VRKL_KORTProperty ?VRKL_KORT .
    ?VRKL_KORTProperty skos:prefLabel "VRKL_KORT" .
  } 
        OPTIONAL {
    ?Symbool ?VRKL_LANGProperty ?VRKL_LANG .
    ?VRKL_LANGProperty skos:prefLabel "VRKL_LANG" .
  }
}
</pre>

<div class="issue" data-number="283"></div>

<div class="issue" data-number="284"></div>


## Wijzigingen tussen versies

<div class="issue" data-number="149"></div>

De [query voor ...]() resulteert in een objectentabel zoals deze:

De query ziet er als volgt uit: 

<pre data-codelanguage="sparql">
</pre>



## Tabel bgt mapping
De [query voor ...]() resulteert in een tabel zoals deze:

De query ziet er als volgt uit: 

<pre data-codelanguage="sparql">
</pre>

## Tabel GWSW mapping

De [query voor ...]() resulteert in een tabel zoals deze:

De query ziet er als volgt uit: 

<pre data-codelanguage="sparql">
</pre>




